; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v5)
             (pred_6 ?v10 ?v3)
             (pred_2 ?v4 ?v3)
             (pred_4 ?v8 ?v4 )
	     (pred_7 ?v4)
             (pred_3 ?v9)
             (pred_9 ?v10)
             (pred_8 ?v3)
             (pred_11 ?v4)
             (pred_1 ?v10)
             (pred_10 ?v4)
             (pred_12 ))



(:action op_3
:parameters (?v6 ?v2 ?v1 ?v12)
:precondition (and (pred_3 ?v6) (pred_3 ?v2) (pred_9 ?v1) (pred_8 ?v12)
          (pred_5 ?v6 ?v2) (pred_6 ?v1 ?v12)
                   (pred_2 ?v2 ?v12) (pred_7 ?v6) 
                   (pred_11 ?v2) (pred_1 ?v1))
:effect (and  (pred_10 ?v2) (not (pred_11 ?v2))))


(:action op_2
:parameters (?v6 ?v7)
:precondition (and (pred_3 ?v6) (pred_3 ?v7)
               (pred_7 ?v6) (pred_5 ?v6 ?v7) (pred_10 ?v7))
:effect (and (pred_7 ?v7) (not (pred_7 ?v6))))

(:action op_1
:parameters (?v6 ?v1)
:precondition (and (pred_3 ?v6) (pred_9 ?v1) 
                  (pred_7 ?v6) (pred_4 ?v1 ?v6) (pred_12 ))
:effect (and (pred_1 ?v1)
   (not (pred_4 ?v1 ?v6)) (not (pred_12 ))))


(:action op_5
:parameters (?v6 ?v11 ?v13)
:precondition (and (pred_3 ?v6) (pred_9 ?v11) (pred_9 ?v13)
                  (pred_7 ?v6) (pred_1 ?v13) (pred_4 ?v11 ?v6))
:effect (and (pred_1 ?v11) (pred_4 ?v13 ?v6)
        (not (pred_1 ?v13)) (not (pred_4 ?v11 ?v6))))

(:action op_4
:parameters (?v6 ?v1)
:precondition (and (pred_3 ?v6) (pred_9 ?v1) 
                  (pred_7 ?v6) (pred_1 ?v1))
:effect (and (pred_12 ) (pred_4 ?v1 ?v6) (not (pred_1 ?v1)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_25 obj_12 obj_04 obj_24 obj_26 obj_05 obj_29 obj_30 obj_13 obj_11 obj_20 obj_06 obj_02 obj_08 obj_10 obj_16 obj_14 obj_21 obj_31 obj_15 obj_07 obj_03 obj_09 obj_22 obj_18
    obj_19 obj_27 obj_01
    obj_23 obj_17 obj_28
    )

    (:init
       (pred_12)

       (pred_3 obj_25)
       (pred_3 obj_12)
       (pred_3 obj_04)
       (pred_3 obj_24)
       (pred_3 obj_26)
       (pred_3 obj_05)
       (pred_3 obj_29)
       (pred_3 obj_30)
       (pred_3 obj_13)
       (pred_3 obj_11)
       (pred_3 obj_20)
       (pred_3 obj_06)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_10)
       (pred_3 obj_16)
       (pred_3 obj_14)
       (pred_3 obj_21)
       (pred_3 obj_31)
       (pred_3 obj_15)
       (pred_3 obj_07)
       (pred_3 obj_03)
       (pred_3 obj_09)
       (pred_3 obj_22)
       (pred_3 obj_18)
       (pred_8 obj_19)
       (pred_8 obj_27)
       (pred_8 obj_01)
       (pred_9 obj_23)
       (pred_9 obj_17)
       (pred_9 obj_28)

       (pred_5 obj_25 obj_05)
       (pred_5 obj_25 obj_12)
       (pred_5 obj_12 obj_29)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_04 obj_30)
       (pred_5 obj_04 obj_24)
       (pred_5 obj_04 obj_12)
       (pred_5 obj_24 obj_13)
       (pred_5 obj_24 obj_26)
       (pred_5 obj_24 obj_04)
       (pred_5 obj_26 obj_11)
       (pred_5 obj_26 obj_24)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_05 obj_29)
       (pred_5 obj_05 obj_25)
       (pred_5 obj_29 obj_06)
       (pred_5 obj_29 obj_30)
       (pred_5 obj_29 obj_12)
       (pred_5 obj_29 obj_05)
       (pred_5 obj_30 obj_02)
       (pred_5 obj_30 obj_13)
       (pred_5 obj_30 obj_04)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_13 obj_24)
       (pred_5 obj_13 obj_30)
       (pred_5 obj_11 obj_10)
       (pred_5 obj_11 obj_26)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_05)
       (pred_5 obj_06 obj_14)
       (pred_5 obj_06 obj_02)
       (pred_5 obj_06 obj_29)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_02 obj_08)
       (pred_5 obj_02 obj_30)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_08 obj_31)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_08 obj_02)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_10 obj_11)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_16 obj_07)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_14 obj_21)
       (pred_5 obj_14 obj_06)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_21 obj_09)
       (pred_5 obj_21 obj_31)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_31 obj_22)
       (pred_5 obj_31 obj_15)
       (pred_5 obj_31 obj_08)
       (pred_5 obj_31 obj_21)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_15 obj_31)
       (pred_5 obj_07 obj_03)
       (pred_5 obj_07 obj_16)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_03 obj_14)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_09 obj_22)
       (pred_5 obj_09 obj_21)
       (pred_5 obj_09 obj_03)
       (pred_5 obj_22 obj_18)
       (pred_5 obj_22 obj_31)
       (pred_5 obj_22 obj_09)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_22)
       (pred_11 obj_30)
       (pred_11 obj_09)
       (pred_11 obj_06)
       (pred_2  obj_30 obj_19)
       (pred_2  obj_09 obj_27)
       (pred_2  obj_06 obj_01)
       (pred_10 obj_25)
       (pred_10 obj_12)
       (pred_10 obj_04)
       (pred_10 obj_24)
       (pred_10 obj_26)
       (pred_10 obj_05)
       (pred_10 obj_29)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_21)
       (pred_10 obj_31)
       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_03)
       (pred_10 obj_22)
       (pred_10 obj_18)

       (pred_6  obj_23 obj_19)
       (pred_6  obj_17 obj_27)
       (pred_6  obj_28 obj_01)
       (pred_4 obj_23 obj_15)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_28 obj_14)
       (pred_7 obj_08)
    )

    (:goal (and
       (pred_4 obj_23 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_10)))
)
)

; plan
1. (op_2 obj_08 obj_31)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_31)
   goals met: 0 of 1
2. (op_2 obj_31 obj_15)
   deleted: (pred_7 obj_31)
   added: (pred_7 obj_15)
   goals met: 0 of 1
3. (op_1 obj_15 obj_23)
   deleted: (pred_4 obj_23 obj_15) (pred_12)
   added: (pred_1 obj_23)
   goals met: 0 of 1
4. (op_2 obj_15 obj_31)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_31)
   goals met: 0 of 1
5. (op_2 obj_31 obj_08)
   deleted: (pred_7 obj_31)
   added: (pred_7 obj_08)
   goals met: 0 of 1
6. (op_2 obj_08 obj_13)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_13)
   goals met: 0 of 1
7. (op_2 obj_13 obj_11)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_23)
   deleted: (pred_1 obj_23)
   added: (pred_12) (pred_4 obj_23 obj_11)
   goals met: 1 of 1
